[
	{
		"Class name": "COMP 110",
		"Department": "Computer Science",
		"Course Title": "Introduction to Algorithm and Programming",
		"Description": "Introduction to algorithms, their representation, design, structuring, analysis and optimization. Implementation of algorithms as structured programs in a high level language.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2008",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 110L",
		"Department": "Computer Science",
		"Course Title": "Introduction to Algorithm and Programming Lab",
		"Description": "The test is divided into three sections. The first section asks you to write an essay. The next two sections assess your ability to comprehend and interpret reading material and your understanding of sentence construction and paragraph development.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2008",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "MATH 150A",
		"Department": "Mathematics",
		"Course Title": "Calculus I",
		"Description": "Limits, derivatives, applications of differentiation. Definite and indefinite integrals, the Fundamental Theorem of Calculus.",
		"Unit": "5",
		"Type": "LEC",
		"Year": "2008",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "MATH 150AL",
		"Department": "Mathematics",
		"Course Title": "Calculus I Lab",
		"Description": "Required for all conditionally prepared students enrolled in MATH 150A. This is a NC/CR enrichment laboratory for students, i.e., this class itself has no credit, but students must have to pass for a credit in MATH 150A.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2008",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 122",
		"Department": "Computer Science",
		"Course Title": "Computer Architecture and Assembly Language",
		"Description": "Introduction to computer architecture, assembly language programming, system software and computer applications. Number systems and data representation. Internal organization of a computer. Primitive instructions and operations. Assembly language.",
		"Unit": "1",
		"Type": "LEC",
		"Year": "2008",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 122L",
		"Department": "Computer Science",
		"Course Title": "Computer Architecture and Assembly Language Lab",
		"Description": "Three hours lab work per week.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2008",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 182",
		"Department": "Computer Science",
		"Course Title": "Data Structure and Program Design",
		"Description": "Introduction to data structures and the algorithms that use them. Review of composite data types such as arrays, records, strings, and sets. Role of the abstract data type in program design. Definition, implementation, and application of data structures such as stacks, queues, linked lists, trees, and graphs. Recursion. Use of time complexity expressions in evaluating algorithms. Comparative study of sorting and searching algorithms.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2008",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 182L",
		"Department": "Computer Science",
		"Course Title": "Data Structure and Program Design Lab",
		"Description": "Three hours lab work per week.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2008",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 222",
		"Department": "Computer Science",
		"Course Title": "Computer Organization",
		"Description": "Extension of basic addressing concepts to more advanced addressability such as base register and self-relative addressing. Comparative computer architecture focusing on such organizations as multiple register processors and stack machines. Basics of virtual memory input-output. Introduction to the concept of microprogrammable systems. Low level language translation process associated with assemblers. System functions such as relocatable loading and memory management. Application of data structure and hashing techniques to the above. Other related topics.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2009",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "MATH 150B",
		"Department": "Mathematics",
		"Course Title": "Calculus II",
		"Description": "Techniques of integration, numerical integration, improper integrals, applications of the integral. Taylor polynomials, sequences and series, power series.",
		"Unit": "5",
		"Type": "LEC",
		"Year": "2009",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "MATH 150BL",
		"Department": "Mathematics",
		"Course Title": "Calculus II Lab",
		"Description": "Required for all conditionally prepared students enrolled in MATH 150B. This is a NC/CR enrichment laboratory for students, i.e., it itself has no credit, but students must have to pass for a credit in MATH 150B.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2009",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "MATH 262",
		"Department": "Mathematics",
		"Course Title": "Introduction to Linear Algebra",
		"Description": "Systems of linear equations, matrices, determinants, eigenvalues, vector spaces, linear transformations, introduction to inner products on Rn, spectral theorem for symmetric matrices.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2009",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 256",
		"Department": "Computer Science",
		"Course Title": "Discrete Structure",
		"Description": "Study of discrete mathematical structures and proof techniques as used in computer science. Discrete structures such as functions, relations, sets, graphs, and trees. Proof techniques such as proof by induction, proof by contradiction, and proof by cases. Counting techniques.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2009",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 256L",
		"Department": "Computer Science",
		"Course Title": "Discrete Structure Lab",
		"Description": "Three hours lab work per week.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2009",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "MATH 326",
		"Department": "Mathematics",
		"Course Title": "Discrete Mathematics",
		"Description": "Propositional calculus, predicate calculus, set algebra, relations, functions, mappings, fields, number systems.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2009",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 282",
		"Department": "Computer Science",
		"Course Title": "Advanced Data Structures",
		"Description": "Introduction to advanced data structures (particularly persistent structures) using object-oriented design. Main memory structures: hash tables, trees. Architectural foundations for files. Large-scale sorting. Hash-based persistent structures. Indexed files. Introduction to databases.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2009",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 322",
		"Department": "Computer Science",
		"Course Title": "Introduction to Operating System and System Architecture",
		"Description": "Examination of the principal types of systems including batch, multi-programming, and time-sharing. Discusses networked system. Considers the salient problems associated with implementing systems including interrupt of event driven systems, multi-tasking, storage and data base management, and input-output. Emphasizes some of the simple algorithms used to solve common problems encountered such as deadlocks, queue service, and multiple access to data.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2009",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 322L",
		"Department": "Computer Science",
		"Course Title": "Introduction to Operating System and System Architecture Lab",
		"Description": "Projects are implemented to reinforce the lectures. Three hours lab work per week.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2009",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "MATH 341",
		"Department": "Mathematics",
		"Course Title": "Applied Statistics I",
		"Description": "Introduction to the practice of statistics, emphasizing the role of probability. Includes basic probability, discrete and continuous probability distributions, expectation and variance, sample surveys and experiments, displaying and summarizing data, sampling distributions, central limit theorem, inference for proportions, chi-square test, least squares regression. ",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2009",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 333",
		"Department": "Computer Science",
		"Course Title": "Concepts of Programming Languages",
		"Description": "Discussion of issues in the design, implementation, and use of high-level programming languages through a historical framework. Including how languages reflect different design philosophies and use requirements and the technical issues in the design of main abstraction constructs of programming languages. Other approaches to imperative or object oriented programming: functional programming, logical programming, and parallel programming.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2010",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 310",
		"Department": "Computer Science",
		"Course Title": "Automata, Languages, and Computation",
		"Description": "Study of the relation of languages (i.e. sets of strings) and machines for processing these languages, with emphasis on classes of languages and corresponding classes of machines. Phrase structure languages and grammar. Types of grammar and classes of languages. Regular languages and finite state automata. Context-free languages and pushdown automata. Unrestricted languages and Turing Machines. Computability models of Turing, Church, Markov, and McCarthy. Applications to programming languages, compiler design, and program design and testing.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2010",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "MATH 482",
		"Department": "Mathematics",
		"Course Title": "Combined Algorithm",
		"Description": "some computer programming experience. Computer oriented study of seminumerical and non-numerical algorithms. Sorting, tree searching, generation of combinatorial structures, algorithm proof techniques, best algorithms, programming complexity.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2010",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 380",
		"Department": "Computer Science",
		"Course Title": "Introduction to Software Engineering",
		"Description": "Concepts and techniques for systems engineering, requirements analysis, design, implementation and testing of large scale computer systems. Principles of software engineering for production of reliable, maintainable and portable software products. Emphasis on object-oriented analysis and design techniques. Topics include unit, integration and systems testing, configuration management, software quality assurance practices, and an introduction to Computer Aided Software Engineering (CASE). ",
		"Unit": "2",
		"Type": "LEC",
		"Year": "2010",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 380L",
		"Department": "Computer Science",
		"Course Title": "Introduction to Software Engineering Lab",
		"Description": "Projects are implemented to reinforce the lectures. Three hours lab work per week.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2010",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 450",
		"Department": "Computer Science",
		"Course Title": "Societal Issues in Computing",
		"Description": "Survey course on the role of the digital computer in modern society. The dangers of the misuse of computers (as in the invasion of privacy), as well as the proper and intelligent use of the machines, are discussed.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2010",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 490",
		"Department": "Computer Science",
		"Course Title": "Senior Design Project",
		"Description": "Project-oriented course to allow students to apply their knowledge of software engineering to the design and implementation of a system to solve a real world problem. Students select and specify a suitable problem, investigate design alternatives and select an appropriate one, implement a solution, and verify and validate the result, all as part of a team effort. The role of digital computers in modern society are investigated including the dangers of computer misuse, as well as the proper and intelligent use of computers. Ethical concerns of software professionals are studied. ",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2010",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 490L",
		"Department": "Computer Science",
		"Course Title": "Senior Design Project Lab",
		"Description": "Three hours lab work per week. Real-world project implementation in the academic enrironment.",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2010",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 491L",
		"Department": "Computer Science",
		"Course Title": "Senior Project Lab",
		"Description": "Project-oriented laboratory to allow students complete the design, implementation, and testing of the team based software engineering project started in COMP 490L. ",
		"Unit": "1",
		"Type": "LAB",
		"Year": "2010",
		"Semester": "Fall",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 410",
		"Department": "Computer Science",
		"Course Title": "Logic Programming",
		"Description": "Programming techniques in the logic programming language PROLOG. Prenex conjunctive normal form and grammatical algorithms. Tableaux, sequenzen, resolution, and other semi-decision procedures. Closures of relations, fixed point theory, control mechanisms, relationship to functional programming.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2011",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 424",
		"Department": "Computer Science",
		"Course Title": "Computer System Security",
		"Description": "Analysis of the need for computer system security, and the security techniques in operating systems, data bases, and computer networks. Supporting techniques such as auditing, risk analysis, and cost-benefit tradeoffs are discussed.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2011",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 426",
		"Department": "Computer Science",
		"Course Title": "Fault-Tolerant Software and Computing",
		"Description": "An examination of dependability requirements in computing, and the basic principles of system-level reliability and fault-tolerance. Software-based implementation of fault-tolerance in distributed systems. Fault-tolerant software and data bases: reliability modeling, fault-tolerance techniques (e.g., recovery blocks, N-version programming), and design approaches.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2011",
		"Semester": "Spring",
		"Available": "TRUE"
	},
	{
		"Class name": "COMP 429",
		"Department": "Computer Science",
		"Course Title": "Computer Network Software",
		"Description": "Basic software design and analysis considerations in networking computers into coherent, cooperating systems capable of processing computational tasks in a distributed manner. Network topology, routing procedures, message multiplexing and process scheduling techniques.",
		"Unit": "3",
		"Type": "LEC",
		"Year": "2011",
		"Semester": "Spring",
		"Available": "TRUE"
	}
]